package _GUI._01_JFrame;

public class c1_d1029_0_GUI {
/*	컨테이너 
	컴포넌트..
	
	*GUI 목적 
		그래픽 이용, 마우스나 키보드를 이용하여 쉽게 입력
	
	*자바 GUI 특징
		강력한 GUI컴포넌트 제공, 쉬운 GUI프로그래밍
	
	*프로그래밍 방법
		AWT패키지와 Swing 패키지에 제공되는 메카니즘 이용
		
	*AWT 패키지 java.awt
		중량컴포넌트
		운영체제에 많은 부담. 오히려 처리속도는 빠름
	
	*Swing 패키지 javax.swing
		경량 컴포넌트
		운영체제에 의존하지 않음.
		j자로 시작하는 클래스
		
	J컴포넌트는 AWT의 컴포넌트를 상속받음
	모든 컴포넌트는 컨테이너에 포함되어야 화면에 출력가능
		
	1. 스윙프레임 작성
	2. 메인메소드 작성 메인에서는 프로그램 실행만!.. 프레임클래스의 생성자에서 모두 작성하기.
	3. 프레임에 스윙컴포넌트 붙이기	
	

	
	*/
	public static void main(String[] args) {
		
		
	}

}
